Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GB204.h
#define _U1GTC_GTC8_POSITION                     0x00000008
#define _U1GTC_GTC8_MASK                         0x00000100
#define _U1GTC_GTC8_LENGTH                       0x00000001

#define _U1WTCL_WTCL_POSITION                    0x00000000
#define _U1WTCL_WTCL_MASK                        0x0000FFFF
#define _U1WTCL_WTCL_LENGTH                      0x00000010

#define _U1WTCL_WTC0_POSITION                    0x00000000
#define _U1WTCL_WTC0_MASK                        0x00000001
#define _U1WTCL_WTC0_LENGTH                      0x00000001

#define _U1WTCL_WTC1_POSITION                    0x00000001
#define _U1WTCL_WTC1_MASK                        0x00000002
#define _U1WTCL_WTC1_LENGTH                      0x00000001

#define _U1WTCL_WTC2_POSITION                    0x00000002
#define _U1WTCL_WTC2_MASK                        0x00000004
#define _U1WTCL_WTC2_LENGTH                      0x00000001

#define _U1WTCL_WTC3_POSITION                    0x00000003
#define _U1WTCL_WTC3_MASK                        0x00000008
#define _U1WTCL_WTC3_LENGTH                      0x00000001

#define _U1WTCL_WTC4_POSITION                    0x00000004
#define _U1WTCL_WTC4_MASK                        0x00000010
#define _U1WTCL_WTC4_LENGTH                      0x00000001

#define _U1WTCL_WTC5_POSITION                    0x00000005
#define _U1WTCL_WTC5_MASK                        0x00000020
#define _U1WTCL_WTC5_LENGTH                      0x00000001

#define _U1WTCL_WTC6_POSITION                    0x00000006
#define _U1WTCL_WTC6_MASK                        0x00000040
#define _U1WTCL_WTC6_LENGTH                      0x00000001

#define _U1WTCL_WTC7_POSITION                    0x00000007
#define _U1WTCL_WTC7_MASK                        0x00000080
#define _U1WTCL_WTC7_LENGTH                      0x00000001

#define _U1WTCL_WTC8_POSITION                    0x00000008
#define _U1WTCL_WTC8_MASK                        0x00000100
#define _U1WTCL_WTC8_LENGTH                      0x00000001

#define _U1WTCL_WTC9_POSITION                    0x00000009
#define _U1WTCL_WTC9_MASK                        0x00000200
#define _U1WTCL_WTC9_LENGTH                      0x00000001

#define _U1WTCL_WTC10_POSITION                   0x0000000A
#define _U1WTCL_WTC10_MASK                       0x00000400
#define _U1WTCL_WTC10_LENGTH                     0x00000001

#define _U1WTCL_WTC11_POSITION                   0x0000000B
#define _U1WTCL_WTC11_MASK                       0x00000800
#define _U1WTCL_WTC11_LENGTH                     0x00000001

#define _U1WTCL_WTC12_POSITION                   0x0000000C
#define _U1WTCL_WTC12_MASK                       0x00001000
#define _U1WTCL_WTC12_LENGTH                     0x00000001

#define _U1WTCL_WTC13_POSITION                   0x0000000D
#define _U1WTCL_WTC13_MASK                       0x00002000
#define _U1WTCL_WTC13_LENGTH                     0x00000001

#define _U1WTCL_WTC14_POSITION                   0x0000000E
#define _U1WTCL_WTC14_MASK                       0x00004000
#define _U1WTCL_WTC14_LENGTH                     0x00000001

#define _U1WTCL_WTC15_POSITION                   0x0000000F
#define _U1WTCL_WTC15_MASK                       0x00008000
#define _U1WTCL_WTC15_LENGTH                     0x00000001

#define _U1WTCH_WTCH_POSITION                    0x00000000
#define _U1WTCH_WTCH_MASK                        0x000000FF
#define _U1WTCH_WTCH_LENGTH                      0x00000008

#define _U1WTCH_WTC16_POSITION                   0x00000000
#define _U1WTCH_WTC16_MASK                       0x00000001
#define _U1WTCH_WTC16_LENGTH                     0x00000001

#define _U1WTCH_WTC17_POSITION                   0x00000001
#define _U1WTCH_WTC17_MASK                       0x00000002
#define _U1WTCH_WTC17_LENGTH                     0x00000001

#define _U1WTCH_WTC18_POSITION                   0x00000002
#define _U1WTCH_WTC18_MASK                       0x00000004
#define _U1WTCH_WTC18_LENGTH                     0x00000001

#define _U1WTCH_WTC19_POSITION                   0x00000003
#define _U1WTCH_WTC19_MASK                       0x00000008
#define _U1WTCH_WTC19_LENGTH                     0x00000001

#define _U1WTCH_WTC20_POSITION                   0x00000004
#define _U1WTCH_WTC20_MASK                       0x00000010
#define _U1WTCH_WTC20_LENGTH                     0x00000001

#define _U1WTCH_WTC21_POSITION                   0x00000005
#define _U1WTCH_WTC21_MASK                       0x00000020
#define _U1WTCH_WTC21_LENGTH                     0x00000001

#define _U1WTCH_WTC22_POSITION                   0x00000006
#define _U1WTCH_WTC22_MASK                       0x00000040
#define _U1WTCH_WTC22_LENGTH                     0x00000001

#define _U1WTCH_WTC23_POSITION                   0x00000007
#define _U1WTCH_WTC23_MASK                       0x00000080
#define _U1WTCH_WTC23_LENGTH                     0x00000001

#define _U2MODE_STSEL_POSITION                   0x00000000
#define _U2MODE_STSEL_MASK                       0x00000001
#define _U2MODE_STSEL_LENGTH                     0x00000001

#define _U2MODE_PDSEL_POSITION                   0x00000001
#define _U2MODE_PDSEL_MASK                       0x00000006
#define _U2MODE_PDSEL_LENGTH                     0x00000002

#define _U2MODE_BRGH_POSITION                    0x00000003
#define _U2MODE_BRGH_MASK                        0x00000008
#define _U2MODE_BRGH_LENGTH                      0x00000001

#define _U2MODE_URXINV_POSITION                  0x00000004
#define _U2MODE_URXINV_MASK                      0x00000010
#define _U2MODE_URXINV_LENGTH                    0x00000001

#define _U2MODE_ABAUD_POSITION                   0x00000005
#define _U2MODE_ABAUD_MASK                       0x00000020
#define _U2MODE_ABAUD_LENGTH                     0x00000001

#define _U2MODE_LPBACK_POSITION                  0x00000006
#define _U2MODE_LPBACK_MASK                      0x00000040
#define _U2MODE_LPBACK_LENGTH                    0x00000001

#define _U2MODE_WAKE_POSITION                    0x00000007
#define _U2MODE_WAKE_MASK                        0x00000080
#define _U2MODE_WAKE_LENGTH                      0x00000001

#define _U2MODE_UEN_POSITION                     0x00000008
#define _U2MODE_UEN_MASK                         0x00000300
#define _U2MODE_UEN_LENGTH                       0x00000002

